---
kind: type
id: T:Autodesk.Revit.DB.Structure.IStructuralSectionsServer
source: html/714479c6-07ea-2832-7f8d-a3a759a44aed.htm
---
# Autodesk.Revit.DB.Structure.IStructuralSectionsServer

Interface for the section type parameter server to implement.

## Syntax (C#)
```csharp
public interface IStructuralSectionsServer : IExternalServer
```